---
type: ITransientElementMaker
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ITransientElementMaker

`Autodesk.Revit.DB.ITransientElementMaker` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Execute | 2016 | `void Execute ()` |